// Переменные

const smt = 123; 
// const не меняет значения
let smb = 123;
// let меняет значения

// Типы данных 

const name = "строка";
const number = 2;
const boolen = true;
const Null = null;

// Шаблонные строки

let userName = "Илья";
let greeting = `Привет, ${userName}! Как дела?`

// Условие

if ( /* условие */x == 7 ) {
    /* если условие верно, то выполняется действие*/
} else if (  /* условие */8 == 0 ) {
    /* если условие верно, то выполняется действие*/
}
else{
    /* если условие НЕ верно, то выполняется действие*/
}